# LAB VTP - VLAN trên EVE-NG

### ***Mục lục***

[1.	Mô hình và chuẩn bị](#1)

[2.	Cấu hình VTP](#2)

- [2.1.	VTP mode server](#2.1)

- [2.2.	VTP mode client](#2.2)

- [2.3.	VTP transparent](#2.3)

[3.	Cấu hình VLAN](#3)

- [3.1.	Bước 1: Cấu hình switch port access và trunk](#3.1)

- [3.2.	Bước 2: Cấu hình 2 port trunk trên switch 1:](#3.2)

- [3.3.	Bước 3: Tiến hành cấu hình IP cho máy ảo và ping thử](#3.3)

[4. Tham khảo](#4)

---

<a name = '1'></a>
# 1. Mô hình và chuẩn bị

![img](../images/2.1.png)

- Chuẩn bị: Tạo mô hình 3 switch layer 2 và 6 máy ảo cirros như hình trên. 

- Mục đích bài lab: 

	-	Cấu hình VTP tự động đồng bộ thông tin các VLAN giữa các switch.

	-	Cấu hình tính năng VLAN trên các switch. 

<a name = '2'></a>
# 2.	Cấu hình VTP

<a name = '2.1'></a>
## 2.1.	VTP mode server 

Phần này cấu hình các switch hoạt động ở chế độ VTP server. 

### Bước 1: Cấu hình VTP mode và VTP domain cho các switch:

- Switch 1: 

	```
	Switch 1: 
	SW1#conf t
	SW1(config)# vtp mode server
	Device mode already VTP Server for VLANS.
	SW1(config)# vtp domain VTPlab
	Changing VTP domain name from NULL to VTPlab
	```

- Switch 2: 

	```
	SW2#conf t
	SW2(config)# vtp mode server
	Device mode already VTP Server for VLANS.
	SW2(config)# vtp domain VTPlab
	Changing VTP domain name from NULL to VTPlab
	```
- Switch 3: Chưa cấu hình VTP domain.

### Bước 2: Kiểm tra lại trạng thái VTP và các VLAN trên các switch: 

```
SW1# show vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : VTPlab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc00.1000
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 5
Configuration Revision            : 0
MD5 digest                        : 0x53 0x62 0x6A 0x51 0xBF 0x61 0x37 0xEF
                                    0x26 0x0A 0x70 0xA1 0xE5 0x4B 0x01 0x34

SW1#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0
1003 tr    101003     1500  -      -      -        -    -        0      0
1004 fdnet 101004     1500  -      -      -        ieee -        0      0
1005 trnet 101005     1500  -      -      -        ibm  -        0      0

Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------
```

Ban đầu, khi chưa cấu hình VLAN, các switch đều có VLAN 1 là VLAN mặc định, trạng thái các VTP đều hoạt động trong mode server và domain **VTPlab**. 

### Bước 3: Cấu hình thêm các VLAN vào Switch 1: 

```
SW1#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

SW1(vlan)#vlan 10
VLAN 10 added:
    Name: VLAN0010
SW1(vlan)#vlan 20
VLAN 20 added:
    Name: VLAN0020
SW1(vlan)#vlan 30
VLAN 30 added:
    Name: VLAN0030
SW1(vlan)#exit
APPLY completed.
Exiting....
SW1#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
10   VLAN0010                         active
20   VLAN0020                         active
30   VLAN0030                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
10   enet  100010     1500  -      -      -        -    -        0      0
20   enet  100020     1500  -      -      -        -    -        0      0
30   enet  100030     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0
1003 tr    101003     1500  -      -      -        -    -        0      0
1004 fdnet 101004     1500  -      -      -        ieee -        0      0
1005 trnet 101005     1500  -      -      -        ibm  -        0      0

Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------

SW1#
```

### Bước 4: Kiểm tra thông tin đã cập nhật trên các SW2 và SW3: 

-	Kiểm tra trên switch 2: 

	![img](../images/2.2.png)

	Ta thấy các thông tin về VLAN 10, 20 và 30 được tạo từ switch 1 đã được cập nhật trên switch 2 do cùng miền VTP domain VTPlab. 

- Kiểm tra trên switch 3: 

	![img](../images/2.3.png)

	Ban đầu, khi mới khởi động, Switch 3 chưa nhận được các bản tin VTP quảng bá nên nó chưa cập nhật các thông tin VLAN. Sau một thời gian, các bản tin VTP được gửi từ switch 1 tới động bộ với switch cả về VTP domain theo cấu hình mặc định. Thông tin các VLAN được hiển thị trên switch 3 như sau: 

	![img](../images/2.4.png)

### Bước 5: Cấu hình Switch 3 có VTP domain khác với 2 switch còn lại: trên switch 2 tạo thêm vlan 20. Sau đó show kết quả như sau:

![img](../images/2.5.png)

Ta thấy, các thông tin VLAN được đồng bộ trên switch 1 và switch 2  do cùng miền VTPlab domain, switch 3 do ở miền VTP domain ABC nên không cập nhật thông tin VLAN 40 được switch 2 thêm vào. 

<a name = '2.2'></a>
## 2.2.	VTP mode client

- Khi switch hoạt động ở mode client thì nó chỉ cập nhật các bản tin VTP từ các Switch VTP server. Nó không có khả năng tạo thêm VLAN và tạo các bản tin VTP quảng bá. Khi cố tình tạo VLAN, sẽ xuất hiện thông báo lỗi như sau: 

	```
	SW3#conf t
	Enter configuration commands, one per line.  End with CNTL/Z.
	SW3(config)#vtp mode client
	Setting device to VTP Client mode for VLANS.
	SW3(config)#vlan 50
	VTP VLAN configuration not allowed when device is in CLIENT mode.
	SW3(config)#
	```

- Cấu hình switch 3 về cùng domain VTPlab với switch 1 để nhận được thông tin cập nhật thêm VLAN 40 như sau:

	```
	SW3(config)#vtp domain VTPlab
	Changing VTP domain name from ABC to VTPlab
	SW3(config)#
	*Aug 11 09:41:34.081: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to VTPlab.
	SW3#show vla
	*Aug 11 09:41:55.903: %SYS-5-CONFIG_I: Configured from console by console
	SW3#show vlan

	VLAN Name                             Status    Ports
	---- -------------------------------- --------- -------------------------------
	1    default                          active    Et0/1, Et0/2, Et0/3
	10   VLAN0010                         active
	20   VLAN0020                         active
	30   VLAN0030                         active
	40   VLAN0040                         active
	1002 fddi-default                     act/unsup
	1003 token-ring-default               act/unsup
	1004 fddinet-default                  act/unsup
	1005 trnet-default                    act/unsup

	VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
	---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
	1    enet  100001     1500  -      -      -        -    -        0      0
	10   enet  100010     1500  -      -      -        -    -        0      0
	20   enet  100020     1500  -      -      -        -    -        0      0
	30   enet  100030     1500  -      -      -        -    -        0      0
	40   enet  100040     1500  -      -      -        -    -        0      0
	1002 fddi  101002     1500  -      -      -        -    -        0      0
	1003 tr    101003     1500  -      -      -        -    srb      0      0
	1004 fdnet 101004     1500  -      -      -        ieee -        0      0

	VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
	---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
	1005 trnet 101005     1500  -      -      -        ibm  -        0      0

	Primary Secondary Type              Ports
	------- --------- ----------------- ------------------------------------------

	SW3#
	```

<a name = '2.3'></a>
## 2.3.	VTP transparent


<a name = '3'></a>
# 3.	Cấu hình VLAN

Sau khi cấu hình VTP ở phần trên, ta thực hiện các bước cấu hình VLAN trên các switch như sau: 

<a name = '3.1'></a>
## 3.1	Bước 1: Cấu hình switch port access và trunk

- Cấu hình trên switch 2 và switch 3 như sau: 

	```
	SW2#conf t
	Enter configuration commands, one per line.  End with CNTL/Z.
	<Cau hinh cac port access>
	SW2(config)#interface ethernet 0/1
	SW2(config-if)#switchport mode access
	SW2(config-if)#switchport access vlan 10
	SW2(config-if)#exit
	SW2(config)#interface ethernet 0/2
	SW2(config-if)#switchport mode access
	SW2(config-if)#switchport access vlan 20
	SW2(config-if)#exit
	SW2(config)#interface ethernet 0/3
	SW2(config-if)#switchport mode access
	SW2(config-if)#switchport access vlan 30
	SW2(config-if)#exit
	<Cau hinh port trunk>
	SW2(config)#interface ethernet 0/0
	SW2(config-if)#switchport trunk encapsulation dot1q
	SW2(config-if)#switchport mode trunk
	SW2(config-if)#exit
	```

- Cấu hình trên switch 3: 

	```
	SW3#conf t
	Enter configuration commands, one per line.  End with CNTL/Z.
	<Cau hinh cac port access>
	SW3(config)#interface ethernet 0/1
	SW3(config-if)#switchport mode access
	SW3(config-if)#switchport access vlan 10
	SW3(config-if)#exit
	SW3(config)#interface ethernet 0/2
	SW3(config-if)#switchport mode access
	SW3(config-if)#switchport access vlan 20
	SW3(config-if)#exit
	SW3(config)#interface ethernet 0/3
	SW3(config-if)#switchport mode access
	SW3(config-if)#switchport access vlan 30
	SW3(config-if)#exit
	<Cau hinh port trunk>
	SW3(config)#interface ethernet 0/0
	SW3(config-if)#switchport trunk encapsulation dot1q
	SW3(config-if)#switchport mode trunk
	SW3(config-if)#exit
	```
- Show thông tin cấu hình như sau: 

	![img](../images/2.6.png)

<a name = '3.2'></a>
## 3.2.	Bước 2: Cấu hình 2 port trunk trên switch 1: 

![img](../images/2.7.png)


<a name = '3.3'></a>
## 3.3. Bước 3: Tiến hành cấu hình IP cho máy ảo và ping thử

-	Ping giữa máy cirros11 và cirros21 cùng switch như khác vlan: 

	![img](../images/2.8.png)

-	Ping giữa cirros11 và cirros12 cùng vlan 10: 

	![img](../images/2.9.png)
